In [1]:
import pandas as pd

In [2]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [3]:
def extract_year(column):
    return column.split("-")[0]

In [7]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

파라미터는???

In [8]:
def get_age(year, current_year):
    return current_year - int(year)

In [11]:
df['age'] = df['year'].apply(get_age, current_year = 2018)

In [12]:
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   18
1  2002-09-24  2002   16
2  2005-12-20  2005   13

In [13]:
def get_introduce(age, prefix, suffix):
    return prefix + str(age) + suffix

In [21]:
df['introduce'] = df['age'].apply(get_introduce, prefix='I am ', suffix=' years old')

In [22]:
df

   yyyy-mm-dd  year  age          introduce
0  2000-06-27  2000   18  I am 18 years old
1  2002-09-24  2002   16  I am 16 years old
2  2005-12-20  2005   13  I am 13 years old

In [26]:
def get_introduce_2(row):
    return 'I was bor in ' +str(row.year)+' my age is'+str(row.age)

In [27]:
df.introduce = df.apply(get_introduce_2, axis=1)

In [28]:
df

   yyyy-mm-dd  year  age                      introduce
0  2000-06-27  2000   18  I was bor in 2000 my age is18
1  2002-09-24  2002   16  I was bor in 2002 my age is16
2  2005-12-20  2005   13  I was bor in 2005 my age is13